Config/DataProcessors/РегистрацияСчетовФактурНаАванс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РегистрацияСчетовФактурНаАванс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС30304</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КассовоеПоступление</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭквайринговаяОперация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПСВычетКт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС30304</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСпособаВыставления</Name>
							<Comment>1 - бумажный, 2 - электронный</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыставления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Enums/КВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КВД</Name>
			<Comment>Коды финансового обеспечения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Деятельность, осуществляемая за счет средств соответствующего бюджета бюджетной системы Российской Федерации (бюджетная деятельность)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внебюджет</Name>
					<Comment>Приносящая доход деятельность (собственные доходы учреждения)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеРаспоряжение</Name>
					<Comment>Средства во временном распоряжении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаГосзадание</Name>
					<Comment>Деятельность по выполнению государственного (муниципального) задания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаИныеЦели</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на иные цели, грантов в форме субсидий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетныеИнвестиции</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на цели осуществления капитальных вложений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваОМС</Name>
					<Comment>Деятельность, осуществляемая по обязательному медицинскому страхованию</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/DataProcessors/РегистрацияСчетовФактурНаАванс/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Инициализация
	ТекстЗаголовкаСообщений = НСтр("ru='Регистрация счетов-фактур на аванс'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьЗначенияПоУмолчаниюСервер();
	
	ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти(НСтр("ru='При изменении организации'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекДанные = Элементы["Список"].ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(ТекДанные, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ОбновитьСлужебныеКолонкиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	ОбновитьКоличествоСоздатьИзменитьКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВсегоПриИзменении(Элемент)
	ОбработатьИзменениеПоляНДС(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокСтавкаНДСПриИзменении(Элемент)
	ОбработатьИзменениеПоляНДС(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетФактураПриИзменении(Элемент)
	
	СписокСчетФактураПриИзмененииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументОснованиеПриИзменении(Элемент)
	
	ОбновитьРеквизитыПлатежногоДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода", Объект.ДатаНачала);
	СтруктураПараметров.Вставить("КонецПериода",  Объект.ДатаОкончания);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма, "УстановитьПериодЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект.ДатаНачала    = РезультатВыбора.НачалоПериода;
		Объект.ДатаОкончания = РезультатВыбора.КонецПериода;
		
		ПриИзмененииПериода();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПроверитьИЗаполнитьПоДаннымУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ВыполнитьПроверкуСформировать();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеСтрок(Команда)
	
	ГрупповоеЗаполнениеСтрокКлиент();

КонецПроцедуры

&НаКлиенте
Процедура ПротоколРаботы(Команда)
	
	ВремТекстовыйДокумент = Новый ТекстовыйДокумент();
	ВремТекстовыйДокумент.ТолькоПросмотр = Истина;
	ВремТекстовыйДокумент.УстановитьТекст(ПротоколРаботы.ПолучитьТекст());
	ВремТекстовыйДокумент.Показать(НСтр("ru='Протокол работы'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСозданных(Команда)
	
	Отбор = Новый Структура("Ссылка", СписокСозданных);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.СчетФактураВыданный.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокИзмененных(Команда)
	
	Отбор = Новый Структура("Ссылка", СписокИзмененных);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.СчетФактураВыданный.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	ДатаОкончания = ТекущаяДатаСеанса();
	
	Объект["Организация"]	= ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	Объект["ДатаНачала"]	= НачалоМесяца(ДатаОкончания);
	Объект["ДатаОкончания"]	= ДатаОкончания;
	
	Обработки.РегистрацияСчетовФактурНаАванс.ЗаполнитьСписокВыбораСтавкиНДС(Элементы.СтавкаНДС.СписокВыбора);
	Обработки.РегистрацияСчетовФактурНаАванс.ЗаполнитьСписокВыбораСтавкиНДС(Элементы.СписокСтавкаНДС.СписокВыбора);
	
	Если НЕ ЗначениеЗаполнено(Объект["СтавкаНДС"]) Тогда
		УстановитьСтавкуНДСДляАвансаПоУмолчанию();
	КонецЕсли;
	
	УстановитьКПС30304ПоУмолчанию();
	
	УстановитьПодсказкиДляКомандОткрытияСписковСчетовФактур();
	
	ТиповаяОперацияСФ = БухгалтерскиеОперацииСервер.ТиповаяОперацияПоУмолчанию(
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.СчетФактураВыданный"));
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// 1. Счет-фактура НЕ указан, Отметка установлена - текст <будет создан>
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Счет-фактура НЕ указан, Отметка установлена - текст <будет создан>'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.СчетФактура");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Условие.ПравоеЗначение = Неопределено;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.Отметка");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню, , , Истина, Ложь, Ложь, Ложь));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<будет создан>");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетФактура");


	//---
	// 2. Счет-фактура НЕ указан, Отметка НЕ установлена - текст <не будет создан>
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Счет-фактура НЕ указан, Отметка НЕ установлена - текст <не будет создан>'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.СчетФактура");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Условие.ПравоеЗначение = Неопределено;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.Отметка");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<не будет создан>");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетФактура");


	//---
	// 3. Счет-фактура указан, Отметка установлена - цвет поля Счет-фактура
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Счет-фактура указан, Отметка установлена - цвет поля Счет-фактура'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.СчетФактура");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Условие.ПравоеЗначение = Неопределено;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.Отметка");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню, , , Истина, Ложь, Ложь, Ложь));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетФактура");


	//---
	// 4. Отметка НЕ установлена - цвет поля Счет-фактура
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Отметка НЕ установлена - цвет поля Счет-фактура'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.Отметка");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НепринятаяВерсия);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетФактура");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДата");


	//---
	// 5. Строка НЕ обработана - текст <нет>
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Строка НЕ обработана - текст <нет>'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.СтрокаОбработана");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СкрытыйВариантОтчетаЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<нет>");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРезультатОбработкиТекст");


	//---
	// 6. Строка обработана, успех - цвет текста
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Строка обработана, успех - цвет текста'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.СтрокаОбработана");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.Успех");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню, , , Истина, Ложь, Ложь, Ложь));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРезультатОбработкиТекст");


	//---
	// 7. Строка обработана, ошибка - цвет текста
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Строка обработана, ошибка - цвет текста'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.СтрокаОбработана");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.Успех");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню, , , Истина, Ложь, Ложь, Ложь));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРезультатОбработкиТекст");


	//---
	// 8. Ставка - текст "<см. счёт на оплату>"
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Ставка - текст ""<см. счёт на оплату>""'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.СчетНаОплату");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Условие.ПравоеЗначение = Неопределено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СкрытыйВариантОтчетаЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<см. счёт на оплату>");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСтавкаНДС");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСуммаНДС");

	
	//---
	// 9. Бумажный код способа выставления счета-фактуры
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Бумажный код способа выставления счета-фактуры'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.КодСпособаВыставления");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 1;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "бумажный");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокКодСпособаВыставления");
	
	
	//---
	// 10. Электронный код способа выставления счета-фактуры
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Электронный код способа выставления счета-фактуры'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Список.КодСпособаВыставления");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 2;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "электронный");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокКодСпособаВыставления");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтавкуНДСДляАвансаПоУмолчанию()
	
	Объект.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСДляАвансаПоУмолчанию(Объект.Организация, Объект.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	УстановитьЗначенияПоУмолчаниюСервер();
	
	ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти(НСтр("ru='При изменении периода'"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчаниюСервер()
	
	УстановитьСтавкуНДСДляАвансаПоУмолчанию();
	
	УстановитьКПС30304ПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКПС30304ПоУмолчанию();
	
	НаДату = Неопределено;
			
	Счет30304 = БухгалтерскийУчетКлиентСервер.СчетПоКоду("303.04", НаДату);
	
	КПС30304ПоУмолчанию = БухгалтерскиеОперацииПовтИсп.КПССчета(
		Объект["Организация"],
		Объект["ИФО"],
		Перечисления.КВД.Внебюджет,
		Объект["ДатаНачала"],
		Счет30304);
		
	Объект["КПС30304"] = КПС30304ПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетФактураПриИзмененииКлиент()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактураСсылка = ТекДанные["СчетФактура"];
	Если ЗначениеЗаполнено(СчетФактураСсылка) Тогда
		ОбновленныеПоля = СписокСчетФактураПриИзмененииСервер(СчетФактураСсылка);
		ЗаполнитьЗначенияСвойств(ТекДанные, ОбновленныеПоля);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокСчетФактураПриИзмененииСервер(СчетФактураСсылка)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактураСсылка, "Дата,Выставлен,КодСпособаВыставления,ДатаВыставления");
	
	Результат = Новый Структура();
	Результат.Вставить("КодСпособаВыставления",	?(ЗначенияРеквизитов.Выставлен, ЗначенияРеквизитов.КодСпособаВыставления, Неопределено));
	Результат.Вставить("ДатаВыставления",		?(ЗначенияРеквизитов.Выставлен, ЗначенияРеквизитов.ДатаВыставления, Неопределено));
	Результат.Вставить("Дата",					ЗначенияРеквизитов.Дата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСлужебныеКолонкиКлиент()
	
	ТекДанные = Элементы["Список"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактураУказан	= ЗначениеЗаполнено(ТекДанные["СчетФактура"]);
	ОтметкаУстановлена	= ТекДанные["Отметка"];
	
	ТекДанные["ОтметкаСоздать"] = ?(ОтметкаУстановлена И НЕ СчетФактураУказан, 1, 0);
	ТекДанные["ОтметкаИзменить"] = ?(ОтметкаУстановлена И СчетФактураУказан, 1, 0);
	
	ОбновитьКоличествоСоздатьИзменитьКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПоляНДС(Элемент)
	
	Перем ИмяИзмененногоПоля;
	
	ТекДанные = Элементы["Список"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяЭлемента = Элемент.Имя;
	
	Если ИмяЭлемента = "СписокВсего" Тогда
		ИмяИзмененногоПоля = "Всего";
		
	ИначеЕсли ИмяЭлемента = "СписокСтавкаНДС" Тогда
		ИмяИзмененногоПоля = "СтавкаНДС";
		
	КонецЕсли;
	
	СтруктураИменПолей = Новый Структура();
	СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС");
	СтруктураИменПолей.Вставить("Всего",			"Всего");
	СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС");
	УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей, Истина); // ЭтоАванс
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитыПлатежногоДокумента()
	
	ТекДанные = Элементы["Список"].ТекущиеДанные;
	
	ДокументСсылка = ТекДанные["ДокументОснование"];
	
	РеквизитыПлатежногоДокумента = ПолучитьРеквизитыПлатежногоДокумента(ДокументСсылка);
	
	ЗаполнитьЗначенияСвойств(ТекДанные, РеквизитыПлатежногоДокумента);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыПлатежногоДокумента(ДокументСсылка)
	
	ЗначенияРеквизитов = Обработки.РегистрацияСчетовФактурНаАванс.ПолучитьРеквизитыПервичногоДокумента(ДокументСсылка);
	
	РеквизитыПлатежногоДокумента = Новый Структура();
	РеквизитыПлатежногоДокумента.Вставить("ДатаПервичногоДокумента",	ЗначенияРеквизитов["Дата"]);
	РеквизитыПлатежногоДокумента.Вставить("НомерПервичногоДокумента",	ЗначенияРеквизитов["Номер"]);
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		РеквизитыПлатежногоДокумента.Вставить("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата"));
	КонецЕсли;
	
	Возврат РеквизитыПлатежногоДокумента;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти(ТекстЧтоИзменилось)
	
	// Предложим очистить табличные части, содержащие данные.
	
	СписокЗаполнен = (Объект["Список"].Количество() > 0);
	
	Если СписокЗаполнен Тогда
		ТекстВопроса = ТекстЧтоИзменилось + НСтр("ru='
			|рекомендуется очистить табличную часть,
			|сведения в ней могут уже не соответствовать данным бух.учета.
			|
			|Продолжить и очистить?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧастиОтвет", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧастиОтвет(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект["Список"].Очистить();
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета()
	
	Если ЕстьОшибкиПередЗаполнениемПоДаннымУчета() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект["Список"].Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена.
		|
		|Продолжить и заполнить?'");
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьПоДаннымУчета_Ответ", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, , ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьПоДаннымУчетаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьИЗаполнитьПоДаннымУчета_Ответ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДаннымУчетаКлиент();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ЕстьОшибкиПередЗаполнениемПоДаннымУчета()
	
	ЕстьОшибки = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект["ДатаНачала"]) Тогда
		ЕстьОшибки = Истина;
		ТекстСообщения = НСтр("ru='Поле ""Дата начала"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаНачала");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект["ДатаОкончания"]) И Объект["ДатаНачала"] > Объект["ДатаОкончания"] Тогда
		ЕстьОшибки = Истина;
		ТекстСообщения = НСтр("ru='Дата начала периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаНачала");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект["Организация"]) Тогда
		ЕстьОшибки = Истина;
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Организация");
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ОчиститьСтатистикуПредыдущегоВызова()
	
	ОчищающаяСтруктура = Новый Структура();
	ОчищающаяСтруктура.Вставить("РезультатОбработкиТекст",	"");
	ОчищающаяСтруктура.Вставить("СтрокаОбработана",			Ложь);
	ОчищающаяСтруктура.Вставить("Успех",					Ложь);
	
	ТаблЧастьСписок = Объект["Список"];
	
	Для Каждого СтрокаТаблицы Из ТаблЧастьСписок Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ОчищающаяСтруктура);
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура ОтразитьСтатистикуРаботы(СтатистикаРаботы)
	
	СтатистикаУспехСоздано		= СтатистикаРаботы["КоличествоУспехСоздано"];
	СтатистикаУспехИзменено		= СтатистикаРаботы["КоличествоУспехИзменено"];
	СтатистикаОшибкаСоздано		= СтатистикаРаботы["КоличествоОшибкаСоздано"];
	СтатистикаОшибкаИзменено	= СтатистикаРаботы["КоличествоОшибкаИзменено"];
	
	СтатистикаУспех		= СтатистикаУспехСоздано + СтатистикаУспехИзменено;
	СтатистикаОшибка	= СтатистикаОшибкаСоздано + СтатистикаОшибкаИзменено;
	
	ОбновитьКоличествоСоздатьИзменитьСервер();
	
	УстановитьПодсказкиДляКомандОткрытияСписковСчетовФактур();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкиДляКомандОткрытияСписковСчетовФактур()
	
	КоличествоСозданных = СписокСозданных.Количество();
	НоваяПодсказка = НСтр("ru='Открыть список созданных счетов-фактур'")
		+ ?(КоличествоСозданных = 0, "", " (" + Строка(КоличествоСозданных) + ")");
	Команды.Найти("ОткрытьСписокСозданных").Подсказка = НоваяПодсказка;
	
	КоличествоИзмененных = СписокИзмененных.Количество();
	НоваяПодсказка = НСтр("ru='Открыть список измененных счетов-фактур'")
		+ ?(КоличествоИзмененных = 0, "", " (" + Строка(КоличествоИзмененных) + ")");
	Команды.Найти("ОткрытьСписокИзмененных").Подсказка = НоваяПодсказка;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоДаннымУчетаКлиент()
	
	РезультатЗадания = ЗаполнитьПоДаннымУчетаСервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияПоДаннымУчетаКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоДаннымУчетаСервер()
	
	Объект["Список"].Очистить();
	
	ОбновитьКоличествоСоздатьИзменитьСервер();
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Регистрация счетов-фактур на аванс'");
	
	ПараметрыПроцедуры = ПолучитьПараметрыПроцедурыЗаполненияПоДаннымУчета();
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.РегистрацияСчетовФактурНаАванс.ЗаполнитьПоДаннымУчета",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияПоДаннымУчетаКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗавершениеЗаполненияПоДаннымУчетаСервер(Результат.АдресРезультата);
		
		Если Объект["Список"].Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='Не обнаружено авансов полученных, требующих выставления счетов-фактур'");
			ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
		КонецЕсли;
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='При поиске авансов полученных возникла ошибка'"), 20, ТекстЗаголовкаСообщений);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияПоДаннымУчетаСервер(АдресРезультата)
	
	РезультатыЗаполнения = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Объект["Список"].Загрузить(РезультатыЗаполнения["ТаблицаСписок"]);
	
	ОбновитьКоличествоСоздатьИзменитьСервер();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПроцедурыЗаполненияПоДаннымУчета()
	
	ШапкаОбработки = Новый Структура("
		|ДатаНачала,
		|ДатаОкончания,
		|Организация,
		|СтавкаНДС,
		|ИФО,
		|КПС30304");
	
	ЗаполнитьЗначенияСвойств(ШапкаОбработки, Объект);
	
	ПустаяТаблицаСписок = Объект["Список"].Выгрузить();
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаОбработки",		ШапкаОбработки);
	ПараметрыПроцедуры.Вставить("ПустаяТаблицаСписок",	ПустаяТаблицаСписок);
	
	Возврат ПараметрыПроцедуры;
	
КонецФункции


&НаСервере
Процедура ОбновитьКоличествоСоздатьИзменитьСервер()
	
	КоличествоСоздать	= Объект["Список"].Итог("ОтметкаСоздать");
	КоличествоИзменить	= Объект["Список"].Итог("ОтметкаИзменить");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоСоздатьИзменитьКлиент()
	
	КоличествоСоздать	= Объект["Список"].Итог("ОтметкаСоздать");
	КоличествоИзменить	= Объект["Список"].Итог("ОтметкаИзменить");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуСформировать()
	
	ОчиститьСообщения();
	
	Если КоличествоСоздать + КоличествоИзменить = 0 Тогда
		ТекстСообщения = НСтр("ru='Не отмечена ни одна строка таблицы.
			|Установите отметку хотя бы для одной строки таблицы'");
		ПоказатьПредупреждение(, ТекстСообщения, , ТекстЗаголовкаСообщений);
	Иначе
		ТекстВопроса = НСтр("ru='Сформировать счета-фактуры для отмеченных строк?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВыполнитьПроверкуСформироватьОтвет", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВыполнитьПроверкуСформироватьОтвет(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если СформироватьСервер() Тогда
			
			ТекстСообщенияШаблон = "";
			
			Если СтатистикаУспехСоздано > 0 Тогда
				ДобавитьСНовойСтроки(ТекстСообщенияШаблон, НСтр("ru='Создано документов: [Создано]'"));
			КонецЕсли;
			
			Если СтатистикаУспехИзменено > 0 Тогда
				ДобавитьСНовойСтроки(ТекстСообщенияШаблон, НСтр("ru='Изменено документов: [Изменено]'"));
			КонецЕсли;
			
			Если СтатистикаОшибка > 0 Тогда
				ДобавитьСНовойСтроки(ТекстСообщенияШаблон, НСтр("ru='Возникло ошибок: [Ошибок]'"));
			КонецЕсли;
			
			ТекстСообщенияШаблон = ТекстСообщенияШаблон + НСтр("ru='
				|
				|Подробности см. в протоколе работы'");
			
			ЗначенияПараметров = Новый Структура();
			ЗначенияПараметров.Вставить("Создано",	СтатистикаУспехСоздано);
			ЗначенияПараметров.Вставить("Изменено",	СтатистикаУспехИзменено);
			ЗначенияПараметров.Вставить("Ошибок",	СтатистикаОшибка);
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщенияШаблон, ЗначенияПараметров);
			
			ПоказатьПредупреждение(, ТекстСообщения, , ТекстЗаголовкаСообщений);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСНовойСтроки(СтрокаПриемник, Добавка)
	
	Если СтрокаПриемник <> "" Тогда
		
		СтрокаПриемник = СтрокаПриемник + "
			|";
		
	КонецЕсли;
	
	СтрокаПриемник = СтрокаПриемник + Добавка;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСервер()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОчиститьСтатистикуПредыдущегоВызова();
	
	СтатистикаРаботы = Обработки.РегистрацияСчетовФактурНаАванс.СформироватьСчетаФактуры(Объект, ПротоколРаботы, СписокСозданных, СписокИзмененных, ТиповаяОперацияСФ);
	
	ОтразитьСтатистикуРаботы(СтатистикаРаботы);
	
	Возврат Истина;
	
КонецФункции

//---
// Групповое заполнение строк
//---

&НаКлиенте
Процедура ГрупповоеЗаполнениеСтрокКлиент()

	КоличествоСтрок = Элементы["Список"].ВыделенныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		ТекстСообщения = НСтр("ru='Выделите несколько строк для выполнения группового заполнения'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
		
		Возврат;
	КонецЕсли;
	
	СвязиПараметровВыбора = Новый Структура();
	СвязиПараметровВыбора.Вставить("Дата",			Объект.ДатаНачала);
	СвязиПараметровВыбора.Вставить("Организация",	Объект.Организация);
	СвязиПараметровВыбора.Вставить("ИФО",			Объект.ИФО);
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("СтавкаНДС",	Объект.СтавкаНДС);
	ЗначенияЗаполнения.Вставить("КПС30304",		Объект.КПС30304);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СвязиПараметровВыбора",	СвязиПараметровВыбора);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",		ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("КоличествоСтрок",			КоличествоСтрок);
	
	ОповещениеВыбор = Новый ОписаниеОповещения("ЗакрытаФормаГрупповогоЗаполненияСтрок", ЭтаФорма);
	
	ОткрытьФорму("Обработка.РегистрацияСчетовФактурНаАванс.Форма.ГрупповоеЗаполнениеСтрок", ПараметрыФормы,,,,, ОповещениеВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаГрупповогоЗаполненияСтрок(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора);
	
	ЗаполнитьВыделенныеСтрокиКлиент(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыделенныеСтрокиКлиент(РезультатВыбора)
	
	Перем	СтавкаНДС,
			МножительСтавки;
	
	ИзмененаСтавкаНДС = РезультатВыбора.Свойство("СтавкаНДС", СтавкаНДС);
	
	Если ИзмененаСтавкаНДС Тогда
		
		МножительСтавки = УчетНДСКлиентСервер.ПолучитьМножительСтавки(Объект["СтавкаНДС"], Истина);
		
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы["Список"].ВыделенныеСтроки;
	
	ТабличнаяЧасть = Объект["Список"];
	
	Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
		
		СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдСтроки);
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыбора);
		
		Если ИзмененаСтавкаНДС Тогда
			
			СтрокаТаблицы["СуммаНДС"] = СтрокаТаблицы["Всего"] * МножительСтавки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
